Revit 2024 API
ReinforcementSettings.RebarPresentationInView Property
 The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public RebarPresentationMode RebarPresentationInView { get; set; }
Visual Basic
Public Property RebarPresentationInView As RebarPresentationMode
	Get
	Set
Visual C++
public:
property RebarPresentationMode RebarPresentationInView {
	RebarPresentationMode get ();
	void set (RebarPresentationMode value);
}
Remarks
 All bars in a given rebar set will be visible if:
The view is a 3D view.
The view direction is not parallel to the rebar normal.
 For this case there are no defaults and no overrides in instances.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace